<!doctype html>
<html>
<head>
	<title>HTML Editor - Full Version</title>
</head>
<body>
<h2>Gameplay</h2>

<h3>Comandi</h3>

<p>&Egrave;&nbsp;necessario accumulare pi&ugrave; punti possibile: c&#39;&egrave; un tempo limitato che indica l&#39;arrivo della Flotta Imperiale. La mappa dei comandi&nbsp;&egrave; quindi la seguente:</p>

<ul>
	<li>W per l&#39;accensione dei motori principali;</li>
	<li>SPAZIO per sfruttare la spinta UltraEngine;</li>
	<li>MOUSE per orientare la nave nella direzione scelta.</li>
</ul>

<p>L&#39;obiettivo &egrave; raccogliere gli artefatti che compaiono nello spazio lungo la partita, evitando il contatto ravvicinato con gli X-Wing nemici. Il giocatore sar&agrave; a conoscenza delle sue prestazioni grazie all&#39;indicatore di tecnologia accumulata in basso a sinistra.</p>

<h3>UltraMotore</h3>

<p>Il giocatore ha a&nbsp;sua disposizione le cariche UltraEngine, che permettono per un brevissimo intervallo di tempo di spostarsi a velocit&agrave; sub-interstellare. Le cariche UltraEngine permettono di sfuggire alla morsa del nemico o di raggiungere pi&ugrave; in fretta gli artefatti. Esse hanno le seguenti caratteristiche:</p>

<ul>
	<li>si rigenerano nel tempo oppure istantaneamente, cio&egrave; ogni volta che un artefatto viene raccolto;</li>
	<li>l&#39;altissimo sprigionamento di calore far&agrave; s&igrave; che la superficie della nave emetta un colore tendente al rosso;</li>
	<li>non &egrave; possibile ottenere una carica UltraEngine nell&#39;intervallo di tempo che la li sta utilizzando (per esempio afferrando un artefatto);</li>
	<li>tutta la materia (nemici inclusi ed eccetto gli artefatti) che si incontrer&agrave; lungo la spinta UltraEngine, sar&agrave; disintegrata e sparir&agrave; dalla mappa;</li>
	<li>caratteristica pi&ugrave; importante da tenere a mente, durante la spinta la nave sar&agrave; quasi ingovernabile, sar&agrave; difficilissimo guidarla e seguir&agrave; principalmente una linea retta.</li>
</ul>

<p>Prima di utilizzare l&#39;UltraEngine &egrave; necessario quindi scegliere una traiettoria ottimale, piena di artefatti o X-Wing da distruggere. Il giocatore sar&agrave; a conoscenza del momento in cui potr&agrave;&nbsp;usare l&#39;UltraEngine data la notifica in basso a destra.</p>

<h3>Orientamento sulla Mappa</h3>

<p>Il giocatore ha a sua disposizione un rilevatore di entit&agrave; cosmiche. Oltre alla nave stessa sempre al centro, saranno visualizzate sulla mappa:</p>

<ul>
	<li>i nemici che si trovano sopra al livello del giocatore, con un simbolo simile alla &quot;X&quot;;</li>
	<li>i nemici che si trovano sotto al livello del giocatore, con un simbolo simile a &quot;--&quot;;</li>
	<li>gli artefatti disponibili sulla mappa, con un semplice punto e senza rilevare la loro altezza.</li>
	<li>i confini esplorabili che, per scopi didattici e per motivi di prestazioni, sono abbastanza contenuti.</li>
</ul>

<p>&nbsp;</p>
</body>
</html>
